app/controllers/invoices/purchases_controller.rb

  def new
    @invoice = Invoice.find(params[:invoice_id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @invoice = Invoice.find(params[:invoice_id])
    @purchase = Purchase.new(purchase_params)
    @purchase.invoice = @invoice

    respond_to do |format|
      if @purchase.save
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "purchases" ("item_id", "category", "quantity", "invoice_id", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item_id", 1], ["category", "Điện thoại"], ["quantity", 1], ["invoice_id", 6], ["created_at", "2021-06-06 07:20:18.455359"], ["updated_at", "2021-06-06 07:20:18.455359"], ["price", 5.0]]

  def destroy
    @invoice = Invoice.find(params[:invoice_id])
    @purchase = Purchase.find(params[:id])
    title = @purchase.item

    if @purchase.destroy
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 4]]