app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("code", "name", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["code", "MH0001"], ["name", "Samsung Galaxy A32"], ["cost", 5000000.0], ["created_at", "2021-06-06 06:46:33.081986"], ["updated_at", "2021-06-06 06:46:33.081986"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Tai nghe Bluetoot 2 VN/A"], ["updated_at", "2021-06-08 06:13:51.413124"], ["id", 4]]