app/views/invoices/purchases/_form.html.erb

SELECT "items".* FROM "items"
---

    <%= collection_select(:purchase,:item_id, Item.all, :id, :name,{}, {:multiple=>false})%>